Revit 2027 API
FabricationPartPlacementUtils Class
 General utility placement methods in the Autodesk Revit MEP product for fabrication.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationPartPlacementUtils
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FabricationPartPlacementUtils
Public NotInheritable Class FabricationPartPlacementUtils
public ref class FabricationPartPlacementUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricationPartPlacementUtils = class end
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace